# 2
import numpy as np
from math import sqrt, log

n = 14
x = [2.8, 2.2, 3.0, 3.5, 3.2, 3.7, 4.0, 4.8, 6.0, 5.4, 5.2, 5.4, 6.0, 9.0]
y = [6.7, 6.9, 7.2, 7.3, 8.4, 8.8, 9.1, 9.8, 10.6, 10.7, 11.1, 11.8, 12.1, 12.4]
alpha = 0.05

r_ = np.corrcoef(x, y)
print('Выборочное значение коэффициента корреляции (с помощью numpy)\n', r_)

# by formulas
x_ = sum(x) / n
y_ = sum(y) / n
r_ = sum([(x[i] - x_) * (y[i] - y_) for i in range(n)]) / \
     sqrt(sum([(x[i] - x_) ** 2 for i in range(n)]) * sum([(y[i] - y_) ** 2 for i in range(n)]))
print('Выборочное значение коэффициента корреляции (по формулам)\n', r_)

if (r_ * sqrt(n - 2)) / sqrt(1 - r_ ** 2) < 1.782:
    print('Гипотеза об отсутствии корреляционной связи принимается')
else:
    print('Гипотеза об отсутствии корреляционной связи отвергается')

# из таблицы учебника Айвазян
# z = 1.462
z = 0.5 * log((1 + r_) / (1 - r_))
print('\nz =', z)

# alpha = 0,05 (0,05/2)
u = 1.9599
z1 = z - (u / sqrt(n - 3)) - (r_ / (2 * (n - 1)))
z2 = z + (u / sqrt(n - 3)) - (r_ / (2 * (n - 1)))

print('Доверительный интервал:')
print(z1, '< r <', z2)
